; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v7 - type_1)
 	      (pred_1 ?v1 - object ?v7 - type_1)
	      (pred_2 ?v5 - type_2 ?v8 - type_3)
	      (pred_4 ?v5 - type_2 ?v1 - object ?v8 - type_3))

   (:action op_2
       :parameters  (?v5 - type_2 ?v6 ?v3 - type_1)
       :precondition (and  (pred_3 ?v5 ?v6))
       :effect (and  (pred_3 ?v5 ?v3)
		     (not (pred_3 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_2 ?v4 - object ?v2 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v2) (pred_3 ?v5 ?v2) (pred_2 ?v5 ?v8))
       :effect (and (pred_4 ?v5 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v2)) 
		    (not (pred_2 ?v5 ?v8))))

   (:action op_3
       :parameters (?v5 - type_2 ?v4 - object ?v2 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v4 ?v8) (pred_3 ?v5 ?v2))
       :effect (and (pred_1 ?v4 ?v2)
		    (pred_2 ?v5 ?v8)
		    (not (pred_4 ?v5 ?v4 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_09 obj_05 - type_3
obj_01 obj_08 obj_10 obj_06 - type_1
obj_04 obj_07 obj_03 - object)
(:init
(pred_3 obj_02 obj_08)
(pred_2 obj_02 obj_09)
(pred_2 obj_02 obj_05)
(pred_1 obj_04 obj_06)
(pred_1 obj_07 obj_01)
(pred_1 obj_03 obj_10)
)
(:goal
(and
(pred_1 obj_04 obj_10)
(pred_1 obj_07 obj_10)
(pred_1 obj_03 obj_10)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_05))))
)
)

; plan
1. (op_2 obj_02 obj_08 obj_01)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_01)
   goals met: 1 of 3
2. (op_1 obj_02 obj_07 obj_01 obj_09)
   deleted: (pred_1 obj_07 obj_01) (pred_2 obj_02 obj_09)
   added: (pred_4 obj_02 obj_07 obj_09)
   goals met: 1 of 3
3. (op_2 obj_02 obj_01 obj_10)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_10)
   goals met: 1 of 3
4. (op_3 obj_02 obj_07 obj_10 obj_09)
   deleted: (pred_4 obj_02 obj_07 obj_09)
   added: (pred_1 obj_07 obj_10) (pred_2 obj_02 obj_09)
   goals met: 2 of 3
5. (op_2 obj_02 obj_10 obj_06)
   deleted: (pred_3 obj_02 obj_10)
   added: (pred_3 obj_02 obj_06)
   goals met: 2 of 3
6. (op_1 obj_02 obj_04 obj_06 obj_09)
   deleted: (pred_1 obj_04 obj_06) (pred_2 obj_02 obj_09)
   added: (pred_4 obj_02 obj_04 obj_09)
   goals met: 2 of 3
7. (op_2 obj_02 obj_06 obj_10)
   deleted: (pred_3 obj_02 obj_06)
   added: (pred_3 obj_02 obj_10)
   goals met: 2 of 3
8. (op_3 obj_02 obj_04 obj_10 obj_09)
   deleted: (pred_4 obj_02 obj_04 obj_09)
   added: (pred_1 obj_04 obj_10) (pred_2 obj_02 obj_09)
   goals met: 3 of 3
